---
kind: enumMember
id: F:Autodesk.Revit.DB.OpenForeignOption.Prompt
enum: Autodesk.Revit.DB.OpenForeignOption
zh: 提示、弹窗、消息框
source: html/c8247945-7f12-a435-35e0-0879b02d4397.htm
---
# Autodesk.Revit.DB.OpenForeignOption.Prompt

**中文**: 提示、弹窗、消息框

If possible, show a prompt to the user if a foreign file is detected. The operation may proceed or cancel based on the response.